In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

In [3]:
df = pd.read_csv("(Titanic)train.csv")[['Age','Pclass','SibSp','Parch','Survived']]
df.sample(5)

      Age  Pclass  SibSp  Parch  Survived
481   NaN       2      0      0         0
120  21.0       2      2      0         0
668  43.0       3      0      0         0
614  35.0       3      0      0         0
798  30.0       3      0      0         0

In [4]:
df.dropna(inplace=True)

In [5]:
df.sample(5)

      Age  Pclass  SibSp  Parch  Survived
827   1.0       2      0      2         1
265  36.0       2      0      0         0
147   9.0       3      2      2         0
489   9.0       3      1      1         1
756  28.0       3      0      0         0

In [6]:
X= df.iloc[:,0:4]
y= df.iloc[:,-1]

In [7]:
X.sample(4)

      Age  Pclass  SibSp  Parch
203  45.5       3      0      0
434  50.0       1      1      0
56   21.0       2      0      0
448   5.0       3      2      1

In [8]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.6933333333333332

In [9]:
# from sklearn.model_selection import train_test_split
# X_train,X_test,Y_train,Y_test =  train_test_split(X,y,test_size=0.2,random_state=42)

## Applying feature construction

In [10]:
X['Family_size'] = X['SibSp']+X['Parch'] + 1

In [11]:
X.sample(7)

      Age  Pclass  SibSp  Parch  Family_size
474  22.0       3      0      0            1
713  29.0       3      0      0            1
236  44.0       2      1      0            2
519  32.0       3      0      0            1
698  49.0       1      1      1            3
504  16.0       1      0      0            1
483  63.0       3      0      0            1

In [12]:
def myFunc(num):
    if num == 1:
        #alone
        return 0
    elif num == 2:
        #small family
        return 1
    else:
        #large family
        return 2

In [13]:
myFunc(4)

2

In [14]:
X['Family_type'] = X['Family_size'].apply(myFunc)

In [15]:
X.sample(5)

      Age  Pclass  SibSp  Parch  Family_size  Family_type
794  25.0       3      0      0            1            0
675  18.0       3      0      0            1            0
400  39.0       3      0      0            1            0
203  45.5       3      0      0            1            0
663  36.0       3      0      0            1            0

In [16]:
X.drop(columns=['SibSp','Parch','Family_size'],inplace=True)

In [17]:
X.sample(5)

      Age  Pclass  Family_type
390  36.0       1            2
516  34.0       2            0
489   9.0       3            2
400  39.0       3            0
50    7.0       3            2

In [18]:
np.mean(cross_val_score(LogisticRegression(),X,y,scoring='accuracy',cv=20))

0.7088492063492063

## Feature Splitting

In [19]:
df = pd.read_csv("(Titanic)train.csv")
df.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
355,356,0,3,"Vanden Steen, Mr. Leo Peter",male,28.0,0,0,345783,9.500,NaN,S
536,537,0,1,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.550,B38,S
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.750,NaN,Q
486,487,1,1,"Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)",female,35.0,1,0,19943,90.000,C93,S
508,509,0,3,"Olsen, Mr. Henry Margido",male,28.0,0,0,C 4001,22.525,NaN,S

In [20]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [21]:
df['Name'].str.split(',',expand =True)

             0                                            1
0       Braund                              Mr. Owen Harris
1      Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2    Heikkinen                                  Miss. Laina
3     Futrelle           Mrs. Jacques Heath (Lily May Peel)
4        Allen                            Mr. William Henry
..         ...                                          ...
886   Montvila                                  Rev. Juozas
887     Graham                         Miss. Margaret Edith
888   Johnston               Miss. Catherine Helen "Carrie"
889       Behr                              Mr. Karl Howell
890     Dooley                                  Mr. Patrick

[891 rows x 2 columns]

In [22]:
df['Name'].str.split(',',expand =True)[1]

0                                  Mr. Owen Harris
1       Mrs. John Bradley (Florence Briggs Thayer)
2                                      Miss. Laina
3               Mrs. Jacques Heath (Lily May Peel)
4                                Mr. William Henry
                          ...
886                                    Rev. Juozas
887                           Miss. Margaret Edith
888                 Miss. Catherine Helen "Carrie"
889                                Mr. Karl Howell
890                                    Mr. Patrick
Name: 1, Length: 891, dtype: object

In [23]:
df['Name'].str.split(',',expand =True)[1].str.split('.',expand = True)

         0                                       1     2
0       Mr                             Owen Harris  None
1      Mrs   John Bradley (Florence Briggs Thayer)  None
2     Miss                                   Laina  None
3      Mrs           Jacques Heath (Lily May Peel)  None
4       Mr                           William Henry  None
..     ...                                     ...   ...
886    Rev                                  Juozas  None
887   Miss                          Margaret Edith  None
888   Miss                Catherine Helen "Carrie"  None
889     Mr                             Karl Howell  None
890     Mr                                 Patrick  None

[891 rows x 3 columns]

In [24]:
df['Name'].str.split(',',expand =True)[1].str.split('.',expand = True)[0]

0         Mr
1        Mrs
2       Miss
3        Mrs
4         Mr
       ...
886      Rev
887     Miss
888     Miss
889       Mr
890       Mr
Name: 0, Length: 891, dtype: object

In [25]:
df['Title'] = df['Name'].str.split(',',expand =True)[1].str.split('.',expand = True)[0]

In [26]:
df[['Title','Name']]

     Title                                               Name
0       Mr                            Braund, Mr. Owen Harris
1      Mrs  Cumings, Mrs. John Bradley (Florence Briggs Th...
2     Miss                             Heikkinen, Miss. Laina
3      Mrs       Futrelle, Mrs. Jacques Heath (Lily May Peel)
4       Mr                           Allen, Mr. William Henry
..     ...                                                ...
886    Rev                              Montvila, Rev. Juozas
887   Miss                       Graham, Miss. Margaret Edith
888   Miss           Johnston, Miss. Catherine Helen "Carrie"
889     Mr                              Behr, Mr. Karl Howell
890     Mr                                Dooley, Mr. Patrick

[891 rows x 2 columns]

In [27]:
(df.groupby('Title').mean()['Survived']).sort_values(ascending=False)

Title
 the Countess    1.000000
 Mlle            1.000000
 Sir             1.000000
 Ms              1.000000
 Lady            1.000000
 Mme             1.000000
 Mrs             0.792000
 Miss            0.697802
 Master          0.575000
 Col             0.500000
 Major           0.500000
 Dr              0.428571
 Mr              0.156673
 Jonkheer        0.000000
 Rev             0.000000
 Don             0.000000
 Capt            0.000000
Name: Survived, dtype: float64

In [28]:
df['Is_married']=0
df['Is_married'].loc[df['Title'] == 'Mrs'] = 1

C:\Users\nagam\anaconda3\lib\site-packages\pandas\core\indexing.py:1732: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_block(indexer, value, name)

In [29]:
df['Is_married']

0      0
1      0
2      0
3      0
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_married, Length: 891, dtype: int64